In [1]:
import psycopg2
from sqlalchemy import create_engine

In [2]:
def get_engine(user, password, host, port, database):
    """
    Returns an engine to the database
    """
    return create_engine('postgresql://{}:{}@{}:{}/{}'.format(user, password, host, port, database))

engine = get_engine(user=input('Enter your username: '), 
                    password=input("enter password: "), 
                    host='localhost', 
                    port=5432, 
                    database=input("Enter database name: "))
print(engine)

Engine(postgresql://rob_the_programmer:***@localhost:5432/employeedata)

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('../files/employees_clean.csv')
df.head()

,EmployeeKey,SalesTerritoryKey,FirstName,LastName,MiddleName,NameStyle,Title,HireDate,BirthDate,LoginID,...,PayFrequency,BaseRate,VacationHours,SickLeaveHours,CurrentFlag,SalesPersonFlag,DepartmentName,StartDate,EndDate,Status
0,1,11,Guy,Gilbert,R,0,Production Technician - WC60,1/28/2006,11/12/1981,adventure-works\guy1,...,1,12.4500,21,30,1,0,Production,1/28/2006,NaN,Current
1,2,11,Kevin,Brown,F,0,Marketing Assistant,8/26/2006,12/1/1986,adventure-works\kevin0,...,2,13.4615,42,41,1,0,Marketing,8/26/2006,NaN,Current
2,3,11,Roberto,Tamburello,NaN,0,Engineering Manager,6/11/2007,6/12/1974,adventure-works\roberto0,...,2,43.2692,2,21,1,0,Engineering,6/11/2007,NaN,Current
3,4,11,Rob,Walters,NaN,0,Senior Tool Designer,7/5/2007,7/23/1974,adventure-works\rob0,...,2,29.8462,48,80,1,0,Tool Design,7/5/2007,12/28/2009,NaN
4,5,11,Rob,Walters,NaN,0,Senior Tool Designer,7/5/2007,7/23/1974,adventure-works\rob0,...,2,29.8462,48,80,1,0,Tool Design,12/28/2009,NaN,Current

In [5]:
df.isnull().sum()

EmployeeKey                0
SalesTerritoryKey          0
FirstName                  0
LastName                   0
MiddleName                13
NameStyle                  0
Title                      0
HireDate                   0
BirthDate                  0
LoginID                    0
EmailAddress               0
Phone                      0
MaritalStatus              0
EmergencyContactName       0
EmergencyContactPhone      0
SalariedFlag               0
Gender                     0
PayFrequency               0
BaseRate                   0
VacationHours              0
SickLeaveHours             0
CurrentFlag                0
SalesPersonFlag            0
DepartmentName             0
StartDate                  0
EndDate                  290
Status                     6
dtype: int64

In [6]:
df.SalesTerritoryKey.dtype

dtype('int64')

In [7]:
df.EmployeeKey.dtype

dtype('int64')

In [8]:
df.FirstName.dtype

dtype('O')

In [9]:
df.columns

Index(['EmployeeKey', 'SalesTerritoryKey', 'FirstName', 'LastName',
       'MiddleName', 'NameStyle', 'Title', 'HireDate', 'BirthDate', 'LoginID',
       'EmailAddress', 'Phone', 'MaritalStatus', 'EmergencyContactName',
       'EmergencyContactPhone', 'SalariedFlag', 'Gender', 'PayFrequency',
       'BaseRate', 'VacationHours', 'SickLeaveHours', 'CurrentFlag',
       'SalesPersonFlag', 'DepartmentName', 'StartDate', 'EndDate', 'Status'],
      dtype='object')

In [10]:
def create_employees_table(engine):
    """
    Creates a table in the database
    """
    conn = engine.connect()
    conn.execute("DROP TABLE IF EXISTS employees;")
    conn.execute("""
        create table employees (
            EmployeeKey serial primary key,
            SalesTerritoryKey smallint,
            FirstName varchar(50) not null,
            LastName varchar(50) not null,
            MiddleName varchar(50),
            NameStyle varchar(50),
            Title varchar(50),
            HireDate date,
            BirthDate date,
            LoginID varchar(50),
            EmailAddress varchar(50),
            Phone varchar(50),
            MaritalStatus varchar(50),
            EmergencyContactName varchar(50),
            EmergencyContactPhone varchar(50),
            SalariedFlag varchar(50),
            Gender varchar(50),
            PayFrequency integer,
            BaseRate decimal,
            VacationHours integer,
            SickLeaveHours integer,
            CurrentFlag integer,
            SalesPersonFlag integer,
            DepartmentName varchar(50),
            StartDate date,
            EndDate date,
            Status varchar(50));
    """)
    conn.close()

In [11]:
create_employees_table(engine)

In [14]:
# insert data into the employees table from a csv file
def insert_employees_data(engine):
    """
    Inserts data into the employees table
    """
    conn = engine.connect()
    conn.execute("""
        COPY employees (
            EmployeeKey,
            SalesTerritoryKey,
            FirstName,
            LastName,
            MiddleName,
            NameStyle,
            Title,
            HireDate,
            BirthDate,
            LoginID,
            EmailAddress,
            Phone,
            MaritalStatus,
            EmergencyContactName,
            EmergencyContactPhone,
            SalariedFlag,
            Gender,
            PayFrequency,
            BaseRate,
            VacationHours,
            SickLeaveHours,
            CurrentFlag,
            SalesPersonFlag,
            DepartmentName,
            StartDate,
            EndDate,
            Status)
        FROM '/Users/rob_the_programmer/Documents/programming/2022/hands_on_data_science/analyzing-employee-data-workspace/files/employees_clean.csv'
        DELIMITER ','
        CSV HEADER;
""")
    conn.close()

In [15]:
insert_employees_data(engine)

In [16]:
df1 = pd.read_csv('../files/dates.csv')
df1.head()

,DateKey,FullDateAlternateKey,DayNumberOfWeek,EnglishDayNameOfWeek,SpanishDayNameOfWeek,FrenchDayNameOfWeek,DayNumberOfMonth,DayNumberOfYear,WeekNumberOfYear,EnglishMonthName,SpanishMonthName,FrenchMonthName,MonthNumberOfYear,CalendarQuarter,CalendarYear,CalendarSemester,FiscalQuarter,FiscalYear,FiscalSemester
0,20050101,1/1/2005,7,Saturday,SÃ¡bado,Samedi,1,1,1,January,Enero,Janvier,1,1,2005,1,3,2005,2
1,20050102,1/2/2005,1,Sunday,Domingo,Dimanche,2,2,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
2,20050103,1/3/2005,2,Monday,Lunes,Lundi,3,3,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
3,20050104,1/4/2005,3,Tuesday,Martes,Mardi,4,4,2,January,Enero,Janvier,1,1,2005,1,3,2005,2
4,20050105,1/5/2005,4,Wednesday,MiÃ©rcoles,Mercredi,5,5,2,January,Enero,Janvier,1,1,2005,1,3,2005,2

In [17]:
df1.isnull().sum()

DateKey                 0
FullDateAlternateKey    0
DayNumberOfWeek         0
EnglishDayNameOfWeek    0
SpanishDayNameOfWeek    0
FrenchDayNameOfWeek     0
DayNumberOfMonth        0
DayNumberOfYear         0
WeekNumberOfYear        0
EnglishMonthName        0
SpanishMonthName        0
FrenchMonthName         0
MonthNumberOfYear       0
CalendarQuarter         0
CalendarYear            0
CalendarSemester        0
FiscalQuarter           0
FiscalYear              0
FiscalSemester          0
dtype: int64

In [18]:
df1.DateKey.dtype

dtype('int64')

In [19]:
df1.columns

Index(['DateKey', 'FullDateAlternateKey', 'DayNumberOfWeek',
       'EnglishDayNameOfWeek', 'SpanishDayNameOfWeek', 'FrenchDayNameOfWeek',
       'DayNumberOfMonth', 'DayNumberOfYear', 'WeekNumberOfYear',
       'EnglishMonthName', 'SpanishMonthName', 'FrenchMonthName',
       'MonthNumberOfYear', 'CalendarQuarter', 'CalendarYear',
       'CalendarSemester', 'FiscalQuarter', 'FiscalYear', 'FiscalSemester'],
      dtype='object')

In [20]:
def create_dates_table(engine):
    '''creates the dates table'''
    conn = engine.connect()
    conn.execute("DROP TABLE IF EXISTS dates;")
    conn.execute("""
        create table dates (
            DateKey serial primary key,
            FullDateAlternateKey date,
            DayNumberOfWeek integer,
            EnglishDayNameOfWeek varchar(50),
            SpanishDayNameOfWeek varchar(50),
            FrenchDayNameOfWeek varchar(50),
            DayNumberOfMonth integer,
            DayNumberOfYear integer,
            WeekNumberOfYear integer,
            EnglishMonthName varchar(50),
            SpanishMonthName varchar(50),
            FrenchMonthName varchar(50),
            MonthNumberOfYear integer,
            CalendarQuarter varchar(50),
            CalendarYear integer,
            CalendarSemester varchar(50),
            FiscalQuarter varchar(50),
            FiscalYear integer,
            FiscalSemester integer);

    """)
    conn.close()

In [21]:
create_dates_table(engine)

In [24]:
# insert data into the dates table from a csv file
def insert_dates_data(engine):
    """
    Inserts data into the dates table
    """
    conn = engine.connect()
    conn.execute("""
        COPY dates (
            DateKey,
            FullDateAlternateKey,
            DayNumberOfWeek,
            EnglishDayNameOfWeek,
            SpanishDayNameOfWeek,
            FrenchDayNameOfWeek,
            DayNumberOfMonth,
            DayNumberOfYear,
            WeekNumberOfYear,
            EnglishMonthName,
            SpanishMonthName,
            FrenchMonthName,
            MonthNumberOfYear,
            CalendarQuarter,
            CalendarYear,
            CalendarSemester,
            FiscalQuarter,
            FiscalYear,
            FiscalSemester)
        FROM '/Users/rob_the_programmer/Documents/programming/2022/hands_on_data_science/analyzing-employee-data-workspace/files/dates.csv'
        DELIMITER ','
        CSV HEADER;
""")
    conn.close()

In [25]:
insert_dates_data(engine)